priconne/app/models/battle.rb

  def first_character_image
    character = Character.where(id: self.characters_first_id)
    character.first.image_url
---
SELECT  `characters`.* FROM `characters` WHERE `characters`.`id` = 1 ORDER BY `characters`.`id` ASC LIMIT 1

  def second_character_image
    character = Character.where(id: self.characters_second_id)
    character.first.image_url
---
SELECT  `characters`.* FROM `characters` WHERE `characters`.`id` = 1 ORDER BY `characters`.`id` ASC LIMIT 1

  def third_character_image
    character = Character.where(id: self.characters_third_id)
    character.first.image_url
---
SELECT  `characters`.* FROM `characters` WHERE `characters`.`id` = 2 ORDER BY `characters`.`id` ASC LIMIT 1

  def fourth_character_image
    character = Character.where(id: self.characters_fourth_id)
    character.first.image_url
---
SELECT  `characters`.* FROM `characters` WHERE `characters`.`id` = 1 ORDER BY `characters`.`id` ASC LIMIT 1

  def fifth_character_image
    character = Character.where(id: self.characters_fifth_id)
    character.first.image_url
---
SELECT  `characters`.* FROM `characters` WHERE `characters`.`id` = 2 ORDER BY `characters`.`id` ASC LIMIT 1