priconne/app/controllers/battles_controller.rb

SELECT `battles`.* FROM `battles`
---
  def index
    @battles = Battle.all

INSERT INTO `battles` (`battle_sprints_id`, `clan_users_id`, `characters_first_id`, `characters_second_id`, `characters_third_id`, `characters_fourth_id`, `characters_fifth_id`, `damage`, `number`, `created_at`, `updated_at`) VALUES (1, 2, 2, 1, 1, 1, 2, 4815, 3, '2018-06-14 16:46:46', '2018-06-14 16:46:46')
---
  def create
    @battle = Battle.new(battle_params)
    p @battle

    respond_to do |format|
      if @battle.save

UPDATE `battles` SET `damage` = 500000, `updated_at` = '2018-06-03 07:39:32' WHERE `battles`.`id` = 3
---
  def update
    respond_to do |format|
      if @battle.update(battle_params)

DELETE FROM `battles` WHERE `battles`.`id` = 1
---
  def destroy
    @battle.destroy

SELECT  `battles`.* FROM `battles` WHERE `battles`.`id` = 1 LIMIT 1
---
    def set_battle
      @battle = Battle.find(params[:id])

SELECT `clan_users`.`id` FROM `clan_users` WHERE `clan_users`.`battle_id` = 1
SELECT  `battle_sprints`.* FROM `battle_sprints` WHERE `battle_sprints`.`battle_id` = 1 ORDER BY `battle_sprints`.`id` ASC LIMIT 1
SELECT `characters`.* FROM `characters`
---
    def set_battle_field
      @clan_users = ClanUser.all
      @battle_sprints = BattleSprint.all
      @characters = Character.all