priconne/app/controllers/battle_sprints_controller.rb

  def index
    @battle_sprints = BattleSprint.all.order(month: :asc)
---
SELECT `battle_sprints`.* FROM `battle_sprints` ORDER BY `battle_sprints`.`month` ASC

  def create
    @battle_sprint = BattleSprint.new(battle_sprint_params)

    respond_to do |format|
      if @battle_sprint.save
---
INSERT INTO `battle_sprints` (`month`, `start_date`, `end_date`, `created_at`, `updated_at`) VALUES ('2018-05-27', '2018-05-27', '2018-05-31', '2018-05-27 07:02:36', '2018-05-27 07:02:36')

  def update
    respond_to do |format|
      if @battle_sprint.update(battle_sprint_params)
---
UPDATE `battle_sprints` SET `name` = '6月度クランバトル', `updated_at` = '2018-06-14 16:14:51' WHERE `battle_sprints`.`id` = 1

  def destroy
    @battle_sprint.destroy
---
DELETE FROM `battle_sprints` WHERE `battle_sprints`.`id` = 3

    def set_battle_sprint
      @battle_sprint = BattleSprint.find(params[:id])
---
SELECT  `battle_sprints`.* FROM `battle_sprints` WHERE `battle_sprints`.`id` = 1 LIMIT 1