priconne/app/controllers/characters_controller.rb

  def index
    @characters = Character.all
---
SELECT `characters`.* FROM `characters`

  def create
    @character = Character.new(character_params)

    respond_to do |format|
      if @character.save
---
INSERT INTO `characters` (`name`, `role`, `image`, `created_at`, `updated_at`) VALUES ('マコト', '前衛', '3_i.jpg', '2018-06-03 08:16:25', '2018-06-03 08:16:25')

  def update
    respond_to do |format|
      if @character.update(character_params)
---
UPDATE `characters` SET `role` = '前衛(アタッカー)', `updated_at` = '2018-06-17 15:30:06' WHERE `characters`.`id` = 2

    def set_character
      @character = Character.find(params[:id])
---
SELECT  `characters`.* FROM `characters` WHERE `characters`.`id` = 1 LIMIT 1