priconne/app/controllers/clan_users_controller.rb

  def index
    @clan_users = ClanUser.all
---
SELECT `clan_users`.* FROM `clan_users`

  def create
    @clan_user = ClanUser.new(clan_user_params)

    respond_to do |format|
      if @clan_user.save
---
INSERT INTO `clan_users` (`name`, `position`, `created_at`, `updated_at`) VALUES ('Soranin', 'master', '2018-05-27 02:33:42', '2018-05-27 02:33:42')

    def set_clan_user
      @clan_user = ClanUser.find(params[:id])
---
SELECT  `clan_users`.* FROM `clan_users` WHERE `clan_users`.`id` = 1 LIMIT 1