priconne/app/views/battles/_form.html.erb

SELECT  `battles`.* FROM `battles` WHERE `battles`.`id` = 3 LIMIT 1
---
        <%= f.radio_button :number, :one, checked: "checked" %>
        <%= f.label t 'activerecord.attributes.battle.one' %>